Revit 2027 API
BuiltInFailures.EditingFailures.LockedDeleted Property
 Pinned objects deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LockedDeleted { get; }
Public Shared ReadOnly Property LockedDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LockedDeleted {
	FailureDefinitionId^ get ();
}
static member LockedDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace